app/controllers/farmings_controller.rb

SELECT "farmings".* FROM "farmings" ORDER BY "farmings"."name" ASC
---
  def index
    @farmings = Farming.order(:name).all