app/controllers/field_diaries_controller.rb

  def index
    @field_diaries = FieldDiary.all
---
SELECT "field_diaries".* FROM "field_diaries"

  def sync
    #current_user

    array = params[:_json]

    array.each do |value|
      farming = Farming.find(value[:id])

      field_diary = FieldDiary.find_by(user_id: @user.id, farming_id: farming.id)

      if field_diary.blank?
        field_diary = FieldDiary.new(name: 'Diario de ' + @user.get_fullname + ": " + farming.name)
        field_diary.user = @user
        field_diary.farming = farming
        field_diary.save
      end
      body = value[:body]
      body.each do |note|
        puts "Id de la nota " + note[:id]
        findNote = Note.find_by(id: note[:id])
        if findNote.nil?
          puts 'GUARDA'
          newNote = Note.new
          newNote.id = note[:id]
          newNote.name = note[:title]
          newNote.body = note[:body]
          newNote.createdDate = note[:date]
          newNote.field_diary = field_diary
          newNote.save
---
SELECT "farmings".* FROM "farmings" WHERE "farmings"."id" = $1 LIMIT $2  [["id", "31bfea98-78cf-4515-9e8d-270db6a51641"], ["LIMIT", 1]]
SELECT "field_diaries".* FROM "field_diaries" WHERE "field_diaries"."user_id" = $1 AND "field_diaries"."farming_id" = $2 LIMIT $3  [["user_id", "c086419c-9c99-47d6-a12a-17c93b416298"], ["farming_id", "31bfea98-78cf-4515-9e8d-270db6a51641"], ["LIMIT", 1]]
INSERT INTO "field_diaries" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Diario de Laurent Castaneda: Papa"], ["created_at", "2024-05-01 07:02:28.234583"], ["updated_at", "2024-05-01 07:02:28.234583"]]
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "notes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "QWE"], ["created_at", "2024-05-01 08:13:10.411111"], ["updated_at", "2024-05-01 08:13:10.411111"]]
INSERT INTO "notes" ("id", "name", "body", "created_at", "updated_at", "field_diary_id", "createdDate") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

            puts 'ACTUALIZA'
            findNote.name = note[:title]
            findNote.body = note[:body]
            findNote.save
          else
            puts 'BORRAR'
            findNote.destroy
---
UPDATE "notes" SET "name" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["name", "Prueba 12"], ["updated_at", "2024-05-01 08:20:47.544347"], ["id", "0fa90fdb-53dd-41d3-a49a-781fb85a9b74"]]
INSERT INTO "notes" ("id", "name", "body", "created_at", "updated_at", "field_diary_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", "0fa90fdb-53dd-41d3-a49a-781fb85a9b74"]]

      end
    end

    @table = Note.joins(:field_diary).select(
      :id,
      'notes.name AS title',
      :body,
      :createdDate,
      'field_diaries.farming_id AS farming_id',
    )
---
SELECT "notes"."id", notes.name AS title, "notes"."body", notes.createdDate AS 'DATE' FROM "notes" INNER JOIN "field_diaries" ON "field_diaries"."id" = "notes"."field_diary_id"

    def set_field_diary
      @field_diary = FieldDiary.find(params[:id])
---
SELECT "field_diaries".* FROM "field_diaries" WHERE "field_diaries"."id" = $1 LIMIT $2  [["id", "a0c2cce1-1207-462e-bb3d-66646852575d"], ["LIMIT", 1]]