app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "frenando40@hotmail.com"], ["LIMIT", 1]]
---
    def create
      self.resource = warden.authenticate!(auth_options)
      set_flash_message!(:notice, :signed_in)
      sign_in(resource_name, resource)
      yield resource if block_given?

      user_json = {}

      if resource.is_banned == true
        user_json = { message: "Tu cuenta se encuntra bloqueada"}
      else
        user_json = {
          email: resource.email,
          token: current_token,
          fullname: resource.first_name + " " + resource.last_name,
          code_role: resource.user_role.code,
          name_role: resource.user_role.name